{
    "Hello, I'm Bruno!": "Olá, eu sou Bruno!",
    "Welcome to my portfolio.":"Bem-vindo ao meu portfólio.",
    "Turning ideas into code":"Transformando ideias em código",
    "I'm a fullstack developer passionate about building scalable and efficient systems.": "Sou um desenvolvedor fullstack movido pela paixão de transformar ideias em código robusto.",
    "Download Resume":"Baixar Currículo",
    "About Me":"Sobre Mim",
    "I am a FullStack developer specializing in Python..":"Sou um desenvolvedor FullStack especializado em Python",
    "I'm a fullstack developer passionate about turning ideas into code. Ever since I started programming, I’ve been fascinated by logic, automation, and how small solutions can create a big impact.": "Sou um desenvolvedor fullstack apaixonado por transformar ideias em código. Desde que comecei a programar, sou fascinado por lógica, automação e por como pequenas soluções podem gerar um grande impacto.",
    "Currently, I'm focused on building efficient APIs, automated systems, and robust applications using technologies like": "Atualmente, estou focado em desenvolver APIs eficientes, sistemas automatizados e aplicações robustas utilizando tecnologias como",
    "and": "e",
    "I also enjoy exploring the front-end with":"Também gosto de explorar o front-end com",
    "and experimenting with clean, functional designs.":"e experimentar designs funcionais e limpos.",
    "Artificial Intelligence has also become a great ally in my daily routine as a developer. With strong technical skills and hands-on experience, I use AI as a tool to quickly understand how libraries and frameworks work—saving time and avoiding hours of reading documentation. This allows me to focus on logic, structure, and building my projects more efficiently.":"A Inteligência Artificial também se tornou uma grande aliada na minha rotina como desenvolvedor. Com habilidades técnicas sólidas e experiência prática, utilizo a IA como uma ferramenta para entender rapidamente o funcionamento de bibliotecas e frameworks — economizando tempo e evitando horas lendo documentação. Isso me permite focar na lógica, na estrutura e no desenvolvimento dos meus projetos de forma mais eficiente.",
    "I'm driven by challenges and always looking to learn something new. Outside of coding, I enjoy gaming, music, and understanding how things work in detail.":"Sou movido por desafios e estou sempre em busca de aprender algo novo. Fora do mundo da programação, gosto de jogos, música e de entender como as coisas funcionam em detalhes.",
    "My Projects":"Meus Projetos",
    "Check out some of the projects I've worked on!":"Confira alguns dos projetos em que trabalhei!",
    "Featured Projects":"Projetos em Destaque",
    "Contact Me":"Contato",
    "Feel free to reach out!":"Fique à vontade para entrar em contato!",
    "Contact":"Contato",
    "Services":"Serviços",
    "Check out some of the services I've offer!":"Confira alguns dos serviços que ofereço!",
    "":""

}